Autodesk.Revit.DB.PathType
Enum determining what kind of path a given external file
reference path is.
Paths are valid for all types of external file references
unless otherwise specified.
Since:
2012
Since:
2012

Autodesk.Revit.DB.PathType.Content
The path is relative to a location in the Revit content libraries.
This value is only valid for ExternalFileReferenceType.KeynoteTable,
ExternalFileReferenceType.AssemblyCodeTable or ExternalFileReferenceType.Decal.

Autodesk.Revit.DB.PathType.Server
The path is to a Revit Server location. This value is only
valid for ExternalFileReferenceType.RevitLink.

Autodesk.Revit.DB.PathType.Absolute
The path is an absolute path to a location on disk or the
network.

Autodesk.Revit.DB.PathType.Relative
The path is relative to the host file's location, or
to the central model's location if the host is workshared.